Catalogs/УзлыПрямогоОбменаДанными.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Catalog>
		<Properties>
			<Name>УзлыПрямогоОбменаДанными</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИмяСтрокиПодключенияУзла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьХешИдентификатораУзла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтотУзел</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВнешнийОбработчикДанных</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДополнительныеОтчетыИОбработки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоположениеWSDL</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>URIПространстваИменСервиса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяСервиса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяТочкиПодключения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяПредопределенногоМенеджераОбмена</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДоступныеСобытия</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>УзелОбмена</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УзлыПрямогоОбменаДанными</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяМетода</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяВызываемогоСобытия</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/УзлыПрямогоОбменаДанными/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы


#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура УстановитьИмяСтрокиПодключенияУзла(Команда)
	УстановитьИмяСтрокиПодключенияУзлаНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьХэшИдентификаторУзла(Команда)
	ОбновитьХэшИдентификаторУзлаНаСервере();		
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьСобытиеПрямогоОбмена(Команда)
		
	УзелИсточник = Объект.Ссылка;
	УзелПолучатель = Элементы.ДоступныеСобытия.ТекущиеДанные.УзелОбмена;
	ИмяМетода = Элементы.ДоступныеСобытия.ТекущиеДанные.ИмяМетода;
	ИмяВызываемогоСобытия = Элементы.ДоступныеСобытия.ТекущиеДанные.ИмяВызываемогоСобытия; 
	ИмяПредопределенногоМенеджераОбмена = Объект.ИмяПредопределенногоМенеджераОбмена;

	ВыполнитьСобытиеПрямогоОбменаНасервере(УзелИсточник, УзелПолучатель, ИмяМетода, ИмяВызываемогоСобытия, ИмяПредопределенногоМенеджераОбмена);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьХэшИдентификаторУзлаНаСервере()
	
	Объект.Код = Обработки.УправлениеНастройкамиПрямогоОбмена.СформироватьХешИдентификаторУзла(Объект.ИмяСтрокиПодключенияУзла);
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьСобытиеПрямогоОбменаНасервере(УзелИсточник, УзелПолучатель, ИмяМетода, ИмяВызываемогоСобытия, ИмяПредопределенногоМенеджераОбмена)
	
	ОбработкаОбъект = Вычислить("Обработки." + ИмяПредопределенногоМенеджераОбмена + ".Создать()");//РеквизитФормыВЗначение("Объект");
	
	Результат = Вычислить("ОбработкаОбъект." + ИмяМетода + "(УзелПолучатель.Наименование)");
	
	Если Результат.Отказ = Истина Тогда
		Сообщить(Результат.ОписаниеОшибки);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьИмяСтрокиПодключенияУзлаНаСервере()
	Объект.ИмяСтрокиПодключенияУзла = СтрокаСоединенияИнформационнойБазы();
КонецПроцедуры

#КонецОбласти
